#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
data.azurerm_client_config.current: Reading...
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mYWY1NzQxNS1mMTNiLTQ3MzAtYjlhMi00ZGZmYWQxOTM2ODc7b2JqZWN0SWQ9YTcyNTdlM2ItMWFiMC00M2QyLWFiMjQtMTExZWUzN2NhN2Q2O3N1YnNjcmlwdGlvbklkPWY5MGI0MTIxLTU3ZjEtNGRiNi1hZGU2LTNiMTJlYTkzMGE2Njt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.mongo_db.random_integer.ri: Refreshing state... [id=15525]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.cr.azurerm_container_registry.cr: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerRegistry/registries/crTwitterAuto]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto]
module.pubip.azurerm_public_ip.pubip: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage]
module.mongo_db.azurerm_cosmosdb_account.db: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.DocumentDB/databaseAccounts/tfex-cosmos-db-15525]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto]
module.ni.azurerm_network_interface.ni: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto]
module.nisga.azurerm_network_interface_security_group_association.nisga: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.ss.azurerm_storage_share.ss: Refreshing state... [id=https://mysonarqubestorage.file.core.windows.net/mysonarqubedata]
module.cg.azurerm_container_group.cg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerInstance/containerGroups/mysonarcube]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "cluster" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + custom_ca_trust_certificates_base64              = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = (sensitive value)
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "rg-twitter-auto"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "akscluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "aks-twitter-auto"
      + node_resource_group                 = "nodeaks"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-twitter-auto"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "Development"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cuatrosr, Action: `pull_request`, Workflow: `On Pull Request`*